tutorials/incompressible/pimpleFoam/LES/BYOG/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/meshParameters"

convertToMeters 1;

vertices
(
    ($fullminX $fullminY $fullminZ)
    ($fullmaxX $fullminY $fullminZ)
    ($fullmaxX $fullmaxY $fullminZ)
    ($fullminX $fullmaxY $fullminZ)
    ($fullminX $fullminY $fullmaxZ)
    ($fullmaxX $fullminY $fullmaxZ)
    ($fullmaxX $fullmaxY $fullmaxZ)
    ($fullminX $fullmaxY $fullmaxZ)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
