tutorials/incompressible/pimpleFoam/LES/BYOG/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            patch;
        nFaces          800;
        startFace       22800;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       23600;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       24000;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       24400;
    }
    upperWall
    {
        type            patch;
        nFaces          400;
        startFace       24800;
    }
)

// ************************************************************************* //
