tutorials/incompressible/pimpleFoam/LES/BYOG/system/include/meshParameters
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
minX -125; //-5;
maxX 125; //15;
minY -215; //-4;
maxY 215; //4;
minZ 0; //0;
maxZ 200; //8;

//[-19.759192  -27.669327   -2.0264416] to [19.759192  27.449999   7.8110995]

fullminX #calc "3 * $minX";
fullmaxX #calc "3 * $maxX";
fullminY #calc "3 * $minY";
fullmaxY #calc "3 * $maxY";
fullminZ #calc "3 * $minZ";
fullmaxZ #calc "3 * $maxZ";


// Calculate each component of the exteriorPoint
extPx #calc "1.5 * $maxX";
extPy #calc "1.5 * $maxY";
extPz #calc "1.5 * $maxZ";

// Assemble the vector from the calculated components
exteriorPoint ($extPx $extPy $extPz);


// Calculate each component of the interiorPoint
intPx #calc "0.5 * $maxX";
intPy #calc "0.5 * $maxY";
intPz #calc "0.5 * $maxZ";

// Assemble the vector from the calculated components
interiorPoint ($intPx $intPy $intPz);
// ************************************************************************* //
